app/services/integrations/orders/upsert_order.rb

      def upsert_items(order)
        order.order_items.destroy_all

        @normalized[:items].each do |item_data|
          product = find_or_upsert_product(item_data)
          upsert_product_mapping(product, item_data) if product && @integration

          order.order_items.create!(
            product:       product,
            sku:           item_data[:sku],
            name:          item_data[:name],
            quantity:      item_data[:quantity],
            unit_price:    item_data[:unit_price].to_f,
            unit_cost:     unit_cost_for_item(item_data, product),
            discount:      item_data[:discount].to_f,
            is_gift:       item_data[:is_gift] || false,
            nf_unit_price: item_data[:nf_unit_price].to_f
          )
---
INSERT INTO "products" ("tenant_id", "sku", "name", "cost_price", "idworks_id", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"