app/services/integrations/orders/upsert_order.rb

      def call
        channel = resolve_channel
        return Result.new(ok: false, order: nil, error_message: "Canal não encontrado para provider '#{@provider}'") unless channel

        ActiveRecord::Base.transaction do
          order = upsert_order(channel)
          upsert_items(order)
          recalculate_costs(order, channel)
          order.save!
---
UPDATE "orders" SET "cost_price" = $1, "margin" = $2, "margin_pct" = $3, "updated_at" = $4 WHERE "orders"."id" = $5  [["cost_price", "50.0"], ["margin", "149.9"], ["margin_pct", "74.99"], ["updated_at", "2026-07-09 15:17:08.387264"], ["id", 1]]

      def upsert_order(channel)
        order = @tenant.orders.find_or_initialize_by(external_id: @normalized[:external_id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."tenant_id" = $1 AND "orders"."external_id" = $2 LIMIT $3  [["tenant_id", 1], ["external_id", "YAMPI-TEST-001"], ["LIMIT", 1]]

      def upsert_items(order)
        order.order_items.destroy_all

        @normalized[:items].each do |item_data|
          product = find_or_upsert_product(item_data)
          upsert_product_mapping(product, item_data) if product && @integration

          order.order_items.create!(
            product:    product,
            sku:        item_data[:sku],
            name:       item_data[:name],
            quantity:   item_data[:quantity],
            unit_price: item_data[:unit_price].to_f,
            unit_cost:  item_data[:unit_cost].to_f,
            discount:   item_data[:discount].to_f
          )
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
INSERT INTO "orders" ("tenant_id", "channel_id", "external_id", "order_number", "gross_value", "cost_price", "freight", "discount", "commission", "operational_cost", "margin", "margin_pct", "status", "payment_method", "customer_name", "customer_tag", "state", "weight_kg", "items_qty", "ordered_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22) RETURNING "id"
INSERT INTO "order_items" ("order_id", "product_id", "sku", "name", "quantity", "unit_price", "unit_cost", "discount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

      def find_or_upsert_product(item_data)
        sku = item_data[:sku].presence
        return nil if sku.blank?

        product = @tenant.products.find_or_initialize_by(sku: sku)

        if product.new_record?
          product.assign_attributes(
            name:       item_data[:name].presence || sku,
            cost_price: item_data[:unit_cost].to_f,
            active:     true
          )
        else
          product.name       = item_data[:name] if item_data[:name].present? && product.name.blank?
---
SELECT "products".* FROM "products" WHERE "products"."tenant_id" = $1 AND "products"."sku" = $2 LIMIT $3  [["tenant_id", 1], ["sku", "SKU-AUTO-001"], ["LIMIT", 1]]
SELECT 1 AS one FROM "products" WHERE "products"."sku" = $1 AND "products"."tenant_id" = $2 LIMIT $3  [["sku", "SKU-AUTO-001"], ["tenant_id", 1], ["LIMIT", 1]]

      def upsert_product_mapping(product, item_data)
        external_id = item_data[:external_product_id].presence || item_data[:sku]

        mapping = IntegrationMapping.find_or_initialize_by(
          tenant:        @tenant,
          integration:   @integration,
          external_type: "product",
          external_id:   external_id
        )
---
SELECT "integration_mappings".* FROM "integration_mappings" WHERE "integration_mappings"."tenant_id" = $1 AND "integration_mappings"."integration_id" = $2 AND "integration_mappings"."external_type" = $3 AND "integration_mappings"."external_id" = $4 LIMIT $5  [["tenant_id", 1], ["integration_id", 1], ["external_type", "product"], ["external_id", "SKU-AUTO-001"], ["LIMIT", 1]]

      def recalculate_costs(order, channel)
        items = order.order_items.reload

        cost_price = items.sum { |i| i.quantity * i.unit_cost.to_f }

        commission_pct   = channel.commission_pct.to_f / 100.0
        commission_fixed = channel.commission_fixed.to_f
        commission = (order.gross_value * commission_pct) + commission_fixed

        operational_cost = items.sum do |item|
          next 0 unless item.product_id
          ChannelOperationalCost.find_by(product_id: item.product_id, channel: channel)&.cost.to_f
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 4]]
SELECT "channel_operational_costs".* FROM "channel_operational_costs" WHERE "channel_operational_costs"."product_id" = $1 AND "channel_operational_costs"."channel_id" = $2 LIMIT $3  [["product_id", 1], ["channel_id", 1], ["LIMIT", 1]]

      def upsert_order_mapping(order)
        return unless @integration

        mapping = IntegrationMapping.find_or_initialize_by(
          tenant:        @tenant,
          integration:   @integration,
          external_type: "order",
          external_id:   @normalized[:external_id]
        )
---
SELECT "integration_mappings".* FROM "integration_mappings" WHERE "integration_mappings"."tenant_id" = $1 AND "integration_mappings"."integration_id" = $2 AND "integration_mappings"."external_type" = $3 AND "integration_mappings"."external_id" = $4 LIMIT $5  [["tenant_id", 1], ["integration_id", 1], ["external_type", "order"], ["external_id", "YAMPI-TEST-004"], ["LIMIT", 1]]