app/jobs/integrations/process_event_job.rb

SELECT "integration_events".* FROM "integration_events" WHERE "integration_events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "integration_events" SET "status" = $1 WHERE "integration_events"."id" = $2  [["status", "processing"], ["id", 1]]
UPDATE "integration_events" SET "status" = $1, "processed_at" = $2, "error_message" = $3 WHERE "integration_events"."id" = $4  [["status", "processed"], ["processed_at", "2026-07-09 15:17:08.411677"], ["error_message", nil], ["id", 1]]
UPDATE "integration_events" SET "status" = $1, "processed_at" = $2, "error_message" = $3 WHERE "integration_events"."id" = $4  [["status", "skipped"], ["processed_at", "2026-07-09 15:26:04.386171"], ["error_message", "No processor configured for shopify/unknown"], ["id", 6]]
---
    def perform(event_id)
      event = IntegrationEvent.find_by(id: event_id)
      return unless event
      return unless event.status == "pending"

      started_at = Time.current
      event.update_columns(status: "processing")

      result = Integrations::EventProcessor.call(event)

      finished_at  = Time.current
      duration_ms  = ((finished_at - started_at) * 1000).round

      if result.success?
        event.update_columns(
          status:       "processed",
          processed_at: finished_at,
          error_message: nil
        )
        log_status = "success"
      elsif result.skipped?
        event.update_columns(
          status:        "skipped",
          processed_at:  finished_at,
          error_message: result.error_message
        )

INSERT INTO "integration_sync_logs" ("tenant_id", "integration_id", "direction", "action", "status", "external_id", "external_type", "request_payload", "response_payload", "error_message", "started_at", "finished_at", "duration_ms", "metadata", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
---
        log_status = "error"
      end

      IntegrationSyncLog.create!(
        tenant:        event.tenant,
        integration:   event.integration,
        direction:     "inbound",
        action:        "process_event",
        status:        log_status,
        external_id:   event.external_id,
        external_type: event.external_type,
        started_at:    started_at,
        finished_at:   finished_at,
        duration_ms:   duration_ms,
        metadata: {
          event_id:   event.id,
          provider:   event.provider,
          event_type: event.event_type,
          processor_metadata: result.metadata
        }
      )