app/services/integrations/event_recorder.rb

INSERT INTO "integration_events" ("tenant_id", "integration_id", "provider", "event_type", "external_id", "external_type", "status", "payload", "headers", "metadata", "received_at", "processed_at", "error_message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
    def call
      if (existing = find_duplicate)
        bump_duplicate_attempt(existing)
        return Result.new(true, existing, nil)
      end

      event = @tenant.integration_events.create!(
        integration:        @integration,
        channel_credential: @channel_credential,
        provider:           @provider,
        event_type:         @event_type,
        external_id:        @external_id,
        external_type:      @external_type,
        status:             "pending",
        payload:            @payload,
        headers:            @headers,
        metadata:           event_metadata,
        received_at:        Time.current
      )

SELECT "integration_events".* FROM "integration_events" WHERE "integration_events"."tenant_id" = $1 AND "integration_events"."event_type" = $2 AND "integration_events"."external_id" = $3 AND "integration_events"."external_type" = $4 AND "integration_events"."integration_id" = $5 ORDER BY "integration_events"."id" ASC LIMIT $6  [["tenant_id", 1], ["event_type", "order.paid"], ["external_id", "YAMPI-TEST-001"], ["external_type", "order"], ["integration_id", 1], ["LIMIT", 1]]
---
      scope = @tenant.integration_events
        .where(event_type: @event_type, external_id: @external_id, external_type: @external_type)