app/controllers/api/v1/dashboard_controller.rb

      def summary
        base = apply_filters(current_tenant.orders.includes(:channel))
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" IN ($1, $2)  [["id", 2], ["id", 1]]

      def order_summary_json(order, with_status: false)
        result = {
          id:            order.id,
          channel_name:  order.channel&.name,
          order_number:  order.order_number,
          customer_name: order.customer_name,
          gross_value:   order.gross_value.to_f.round(2),
          margin:        order.margin.to_f.round(2),
          margin_pct:    order.margin_pct.to_f,
          ordered_at:    order.ordered_at
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" IN ($1, $2)  [["id", 2], ["id", 1]]