app/controllers/api/v1/integration_sync_logs_controller.rb

SELECT "integrations".* FROM "integrations" WHERE "integrations"."id" IN ($1, $2)  [["id", 2], ["id", 1]]
---
      def index
        base  = apply_filters(current_tenant.integration_sync_logs)
        logs  = base.includes(:integration)
                    .order("integration_sync_logs.created_at DESC")

        per   = [[params.fetch(:per_page, PER_PAGE_DEFAULT).to_i, 1].max, PER_PAGE_MAX].min
        paged = logs.page(params[:page]).per(per)

SELECT "integration_sync_logs".* FROM "integration_sync_logs" WHERE "integration_sync_logs"."tenant_id" = $1 AND "integration_sync_logs"."id" = $2 LIMIT $3  [["tenant_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "integrations".* FROM "integrations" WHERE "integrations"."id" = $1  [["id", 1]]
---
      def show
        log = current_tenant.integration_sync_logs
          .includes(:integration)
          .find(params[:id])