app/controllers/api/v1/integration_health_controller.rb

      def index
        integrations = current_tenant.integrations.active.includes(:channel)

        render json: integrations.map { |i| health_json(i) }
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" IN ($1, $2, $3)  [["id", 1], ["id", 2], ["id", 3]]
SELECT "integrations".* FROM "integrations" WHERE "integrations"."tenant_id" = $1 AND "integrations"."active" = $2  [["tenant_id", 1], ["active", true]]

      def health_json(integration)
        since_24h = 24.hours.ago

        events_scope = current_tenant.integration_events
                         .where(integration_id: integration.id)
        logs_scope   = current_tenant.integration_sync_logs
                         .where(integration_id: integration.id)

        last_event_at         = events_scope.maximum(:created_at)
        last_success_at       = logs_scope.where(status: "success").maximum(:finished_at)
        last_error_at         = logs_scope.where(status: "error").maximum(:finished_at)
        events_pending_count  = events_scope.where(status: "pending").count
        events_error_count    = events_scope.where(status: "error").count
        logs_success_last_24h = logs_scope.where(status: "success")
                                          .where("created_at >= ?", since_24h).count
        logs_error_last_24h   = logs_scope.where(status: "error")
                                          .where("created_at >= ?", since_24h).count
---
SELECT MAX("integration_events"."created_at") FROM "integration_events" WHERE "integration_events"."tenant_id" = $1 AND "integration_events"."integration_id" = $2  [["tenant_id", 1], ["integration_id", 1]]
SELECT MAX("integration_sync_logs"."finished_at") FROM "integration_sync_logs" WHERE "integration_sync_logs"."tenant_id" = $1 AND "integration_sync_logs"."integration_id" = $2 AND "integration_sync_logs"."status" = $3  [["tenant_id", 1], ["integration_id", 1], ["status", "success"]]
SELECT COUNT(*) FROM "integration_events" WHERE "integration_events"."tenant_id" = $1 AND "integration_events"."integration_id" = $2 AND "integration_events"."status" = $3  [["tenant_id", 1], ["integration_id", 1], ["status", "pending"]]
SELECT COUNT(*) FROM "integration_events" WHERE "integration_events"."tenant_id" = $1 AND "integration_events"."integration_id" = $2 AND "integration_events"."status" = $3  [["tenant_id", 1], ["integration_id", 1], ["status", "error"]]
SELECT COUNT(*) FROM "integration_sync_logs" WHERE "integration_sync_logs"."tenant_id" = $1 AND "integration_sync_logs"."integration_id" = $2 AND "integration_sync_logs"."status" = $3 AND (created_at >= $4)  [["tenant_id", 1], ["integration_id", 1], ["status", "success"], [nil, "2026-07-08 16:02:38.611705"]]
SELECT COUNT(*) FROM "integration_sync_logs" WHERE "integration_sync_logs"."tenant_id" = $1 AND "integration_sync_logs"."integration_id" = $2 AND "integration_sync_logs"."status" = $3 AND (created_at >= $4)  [["tenant_id", 1], ["integration_id", 1], ["status", "error"], [nil, "2026-07-08 16:02:38.611705"]]