app/controllers/api/v1/orders_controller.rb

      def index
        orders = apply_filters(current_tenant.orders.includes(:channel))
          .order(ordered_at: :desc, created_at: :desc)

        per   = [[params.fetch(:per_page, PER_PAGE_DEFAULT).to_i, 1].max, PER_PAGE_MAX].min
        paged = orders.page(params[:page]).per(per)
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" IN ($1, $2)  [["id", 2], ["id", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."tenant_id" = $1 ORDER BY "orders"."ordered_at" DESC, "orders"."created_at" DESC LIMIT $2 OFFSET $3  [["tenant_id", 1], ["LIMIT", 50], ["OFFSET", 0]]

      def show
        order = current_tenant.orders
          .includes(:channel, :order_refunds, order_items: :product, integration_mappings: :integration)
          .find(params[:id])
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" = $1  [["id", 2]]
SELECT "integrations".* FROM "integrations" WHERE "integrations"."id" = $1  [["id", 2]]
SELECT "orders".* FROM "orders" WHERE "orders"."tenant_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["tenant_id", 1], ["id", 7], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1  [["id", 4]]