app/controllers/api/v1/webhooks_controller.rb

SELECT "integrations".* FROM "integrations" WHERE "integrations"."tenant_id" = $1 AND "integrations"."active" = $2 AND "integrations"."provider" = $3 LIMIT $4  [["tenant_id", 1], ["active", true], ["provider", "yampi"], ["LIMIT", 1]]
---
      def receive
        provider     = params[:provider].to_s.downcase
        payload      = parsed_json_payload
        safe_headers = redacted_headers

        event_type    = extract_event_type(payload)
        external_id   = extract_external_id(payload)
        external_type = extract_external_type(payload, event_type)
        integration   = current_tenant.integrations.active.find_by(provider: provider)

SELECT "tenants".* FROM "tenants" WHERE "tenants"."slug" = $1 LIMIT $2  [["slug", "hidrabene"], ["LIMIT", 1]]
---
      def set_tenant_from_request!
        slug = request.headers["X-Tenant-Slug"].presence || params[:tenant_slug]
        unless slug
          render json: { error: "X-Tenant-Slug header obrigatório" }, status: :bad_request and return
        end

        @current_tenant = Tenant.find_by(slug: slug)